SOAP/src/test/resources/getTable.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://www.baeldung.com/springsoap/gen">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:getResourceRequest>
            <gs:id>test</gs:id>
        </gs:getResourceRequest>
    </soapenv:Body>
</soapenv:Envelope>